Ficha 2: Network Address Translation (NAT)
**Objetivos e Tópicos Abordados:**Esta ficha tem como objetivo principal a utilização de endereços privados em redes internas como forma de preservar o espaço de endereçamento IPv4 [18], focando-se na configuração e utilização de Network Address Translation (NAT) em redes locais com routers Cisco [19].
Conceitos Chave de NAT:

O NAT (definido no RFC 1631) foi criado para responder à escassez de endereços IPv4 [20]. Permite que máquinas de redes locais com endereços privados (RFC 1918) comuniquem com o exterior, traduzindo o endereço privado para um endereço público no router de acesso [20].

Conceitos Fundamentais:
◦
'Inside': A rede onde são utilizados os endereços privados [20].
◦
'Outside': Corresponde à rede com endereços públicos, geralmente [20].
◦
'Inside local': Endereço usado pelas máquinas da rede interna para comunicação entre si [20].
◦
'Outside local': O endereço para o qual o 'inside local' é traduzido quando uma máquina interna comunica externamente [20].
◦
'Inside global': Endereço que uma máquina externa usa para comunicar com uma máquina interna [20].
◦
'Outside global': Endereços usados por máquinas externas para comunicar entre si [20].

O mapeamento pode ser de um para um, de N para um, de N para M, estático ou dinâmico [20]. A keyword overload (conhecida como Port Address Translation, PAT) permite que vários endereços internos sejam traduzidos para o mesmo endereço externo, distinguindo-os por diferentes portas [21].
--------------------------------------------------------------------------------
Resolução dos Exercícios da Ficha 2 (Baseado em "Ficha 2.pdf" e "PL02.pdf"):
Passos Básicos Gerais de Configuração:
1.
Os mesmos passos iniciais de ligação e configuração do Hyperterminal que na Ficha 1 [22].
2.
Ligar o cabo do PC ao Router (Ethernet – espaço de cima) [22].
3.
Ligar o cabo do Router à rede da sala (Fast Ethernet – espaço de baixo) [22].
Exercício 1: Configuração Básica de NAT

Objetivo: Configurar o router como servidor NAT. A rede 'inside' é 192.168.X.0/24, com a interface Ethernet0 do router como 'inside' (192.168.X.254). A interface FastEthernet0 é 'outside' (10.254.0.N) e ligada à rede do laboratório (10.254.0.0/24) [23, 24]. A access list deve permitir o NAT para todas as máquinas internas, utilizando um único endereço 'outside local' [24]. O PC 'inside' deve ser configurado manualmente com 192.168.X.100 [24]. A conectividade deve ser verificada com ping para o servidor 10.254.0.Y, e o endereço 'outside local' usado pela máquina deve ser verificado na consola desse servidor [25].

Configuração do Router (R1):
◦
R1> enable [26]
◦
R1# config t [26]
◦
R1(config)# access-list 25 permit 192.168.<X>.0 0.0.0.255 [26]
◦
R1(config)# ip nat inside source list 25 interface f0 overload [26]
◦
R1(config)# int e0 [26]
◦
R1(config-if)# ip address 192.168.<X>.254 255.255.255.0 [26]
◦
R1(config-if)# ip nat inside [26]
◦
R1(config-if)# no shutdown [26]
◦
R1(config-if)# exit [26]
◦
R1(config)# int f0 [26]
◦
R1(config-if)# ip address 10.254.0.<N> 255.255.255.0 [26]
◦
R1(config-if)# ip nat outside [26]
◦
R1(config-if)# no shutdown [26]
◦
R1(config-if)# end [26]

Configuração do PC:
◦
Navegar para "Control Panel → Network & Internet → Network & Sharing Center" [27].
◦
Clicar em "Change adapter settings" [27].
◦
Botão direito na rede → "Properties" [27].
◦
Selecionar "TCP/IPv4" → "Properties" [27].
◦
Selecionar "Use the following IP address" e preencher: * IP address: 192.168. [27] * Subnet mask: 255.255.255.0 [27] * Default gateway: 192.168. [27]
◦
Opcional: "Use the following DNS server addresses" e colocar 8.8.8.8 [27].
◦
ipconfig /all [27].
◦
PC1> ping 10.254.0.<Y> [27].
Exercício 2: Atribuição Estática e Dinâmica de Endereços NAT

Objetivo: Alterar a configuração NAT para definir mapeamentos estáticos e dinâmicos [28]. A máquina 192.168.X.200 deve ter um mapeamento estático para 10.254.0.(N*16+1) [28]. Uma "pool" de endereços, net-TESTE, tipo overload, deve ser definida para 10.254.0.(N*16+2) a 10.254.0.(N*16+5) [28]. Todas as máquinas com endereço interno diferente de 192.168.X.200 devem ser mapeadas para esta "pool" [28].

Configuração do Router (R1):
◦
R1# config t [29]
◦
R1(config)# access-list 25 deny 192.168.<X>.200 0.0.0.0 (Esta linha nega o endereço que terá mapeamento estático, o que é recomendado para clareza, embora o mapeamento estático tenha precedência [30]) [29]
◦
R1(config)# access-list 25 permit 192.168.<X>.0 0.0.0.255 [29]
◦
R1(config)# ip nat inside source static 192.168.<X>.200 10.254.0.(<N> * 16 + 1) [29]
◦
R1(config)# ip nat pool net-TESTE 10.254.0.(<N> * 16 + 2) 10.254.0.(<N> * 16 + 5) netmask 255.255.255.0 [29]
◦
R1(config)# ip nat inside source list 25 pool net-TESTE overload [29]

Configuração do PC:
◦
Configurar o PC com o endereço inside local estático definido (192.168.
◦
Re-configurar o PC com um endereço diferente do estático e repetir o ping [31].
Exercício 3: NAT com Endereços Públicos do Cliente

Objetivo: Adaptar o cenário para usar uma rede válida do cliente (172.16.(X+N).0/24) como "pool" de NAT, em vez de endereços do ISP [33]. A rede interna (inválida) do cliente permanece 192.168.X.0/24 e a rede do operador 10.254.0.0/24 [33].

Configuração do Router (R1):
◦
R1(config)# ip nat pool net-TESTE 172.16.(<X> + <N>).29 172.16.(<X> + <N>).30 netmask 255.255.255.0 [32]
◦
R1(config)# ip nat inside source list 25 pool net-TESTE overload [34]
◦
R1(config)# access-list 25 permit 192.168.<X>.0 0.0.0.255 [34]

Verificação: Fazer ping para o servidor 10.254.0.Y e verificar o endereço IP 'outside local' usado na consola do servidor [33]. Explicar a tradução de endereços [33].
Exercício 4: Informação de Estado e de Debugging

Objetivo: Experimentar e interpretar os comandos de estado e debugging para NAT [35]:
◦
R1# show ip nat translation
◦
R1# clear ip nat translation *
◦
R1# show ip nat statistics
◦
R1# clear ip nat statistics
◦
R1# debug ip nat
◦
R1# debug ip nat detailed
◦
(Não são fornecidos comandos de configuração adicionais na "PL02.pdf" para este exercício, apenas os comandos de verificação) [35].
