 Ficha 1: Dynamic Host Configuration Protocol (DHCP)
**Objetivos e Tópicos Abordados:**O objetivo principal desta ficha é familiarizar-se com a configuração dinâmica de máquinas numa rede, focando-se na configuração e utilização do Dynamic Host Configuration Protocol (DHCP) em redes locais com routers Cisco [1, 2].
Conceitos Chave de DHCP:

O DHCP é um protocolo (definido no RFC 2131) que permite que as máquinas numa rede obtenham informação de configuração automaticamente a partir de um servidor [3].

Normalmente, é usado para atribuir endereços IP, bem como informação sobre a máscara de rede, o gateway de defeito e o servidor de DNS [3]. No entanto, muitas outras opções podem ser configuradas [3].

Num ambiente DHCP, podem existir clientes (máquinas que solicitam parâmetros de configuração por broadcast UDP), servidores (respondem aos pedidos dos clientes) e proxies (reencaminham pedidos se clientes e servidores não estiverem na mesma rede, tipicamente routers) [3].

A partir da versão 12.0 do IOS da Cisco, os routers podem atuar como servidores DHCP [3].

Uma característica importante é o lease time, um limite de validade para os endereços IP atribuídos, que exige renovação se o cliente quiser manter o endereço [3].

Os endereços podem ser escolhidos dinamicamente de gamas ou ter uma correspondência fixa entre endereço MAC e IP [3].
--------------------------------------------------------------------------------
Resolução dos Exercícios da Ficha 1 (Baseado em "Ficha 1 PT.pdf" e "PL01.pdf"):
Passos Básicos Gerais de Configuração:
1.
Ligar o computador e preencher a password em minúsculas [4].
2.
Iniciar sessão no Hyperterminal com as seguintes configurações: 9600 bits por segundo, 8 Data bits, No parity, 1 Stop bits, No flow control [4].
3.
Ligar o router e esperar que complete o processo de arranque. O modo de configuração deve estar DESATIVADO [4].
4.
Ligar o cabo do PC ao Router (porta Ethernet) [4].
Exercício 1: Configuração Básica de um Servidor DHCP

Objetivo: Configurar o router para funcionar como servidor DHCP na rede local (192.168.X.0/24), com a interface Ethernet0 do router a ter o endereço 192.168.X.254 [5]. A "pool" de endereços deve abranger toda a rede, ser nomeada GRUPO-N, e o default router definido. Os endereços de .1 a .31 e de .224 a .254 devem ser reservados [6]. O computador cliente deve obter a configuração dinamicamente e a ligação deve ser verificada com um ping ao router [7].

Configuração do Router (R1):
◦
R1> enable [4]
◦
R1# config t [8]
◦
R1(config)# int e0 [8]
◦
R1(config-if)# ip address 192.168.<X>.254 255.255.255.0 [8]
◦
R1(config-if)# no shutdown [8]
◦
R1(config-if)# exit [8]
◦
R1(config)# service dhcp [8]
◦
R1(config)# ip dhcp pool GRUPO-<N> [8]
◦
R1(dhcp-config)# network 192.168.<X>.0 255.255.255.0 [8]
◦
R1(dhcp-config)# default-router 192.168.<X>.254 [8]
◦
R1(dhcp-config)# exit [8]
◦
R1(config)# ip dhcp excluded-address 192.168.<X>.1 192.168.<X>.31 [8]
◦
R1(config)# ip dhcp excluded-address 192.168.<X>.224 192.168.<X>.254 [8]
◦
R1(config)# end [8]

Configuração do PC:
◦
Abrir "Control Panel → Network & Internet → Network & Sharing Center" [9].
◦
Clicar em "Change adapter settings" [9].
◦
Botão direito na rede → "Properties" [9].
◦
Selecionar "TCP/IPv4" → "Properties" [9].
◦
Selecionar "Obtain an IP address automatically" e "Obtain DNS server address automatically" [9].
◦
ipconfig /all para verificar se DHCP está ativado [9].
◦
ipconfig /release seguido de ipconfig /renew para renovar a configuração de rede [9].
◦
ping 192.168.<X>.254 para verificar a ligação [9].
◦
O PC deve obter o endereço IP 192.168., pois é o primeiro disponível após as exclusões [9].

Verificação no Router:
◦
R1# show ip dhcp binding para observar os endereços IP, MAC, tempo de validade e tipo [10].
Exercício 2: Adicionar Opções DHCP

Objetivo: Acrescentar à configuração do servidor DHCP os servidores de DNS (primário .31 da rede local, secundário 10.254.0.252), o nome de domínio DNS (net-N.dei.uc.pt) e o endereço do servidor de nomes NetBIOS (WINS) (10.1.0.253) [11].

Configuração do Router (R1):
◦
R1# config t [10]
◦
R1(config)# ip dhcp pool GRUPO-<N> [10]
◦
R1(dhcp-config)# dns-server 192.168.<X>.31 10.254.0.252 [10]
◦
R1(dhcp-config)# domain-name net-<N>.dei.uc.pt [10]
◦
R1(dhcp-config)# netbios-name-server 10.1.0.253 [10]
◦
R1(dhcp-config)# exit [10]
◦
R1(config)# end [10]
Exercício 3: Definição do Período de 'Lease' e Debugging

Objetivo: Definir um lease time de 2 minutos para o servidor DHCP, forçar o cliente a obter a nova configuração e verificar. Correr os comandos debug ip dhcp server event e debug ip dhcp server packet. Verificar as estatísticas com show ip dhcp server statistics [12, 13].

Configuração do Router (R1):
◦
R1# config t [10]
◦
R1(config)# ip dhcp pool GRUPO-<N> [10]
◦
R1(dhcp-config)# lease 0 0 2 [10]

Configuração do PC:
◦
PC1> ipconfig /release [14]
◦
PC1> ipconfig /renew [14]
◦
PC1> ipconfig /all para verificar se o lease time está atualizado [14].

Debugging no Router:
◦
R1# debug ip dhcp server event [14]
◦
R1# debug ip dhcp server packet [14]
◦
R1# show ip dhcp server statistics [14]
Exercício 4: Atribuição Estática de Endereços

Objetivo: Configurar o servidor para atribuir um IP fixo ao PC, que não deve pertencer à gama dinâmica [15]. Verificar com show ip dhcp binding, limpar a tabela DHCP com clear ip dhcp binding *, e obrigar o PC a obter a nova configuração [15, 16].

Configuração do Router (R1):
◦
R1# config t [14]
◦
R1(config)# ip dhcp pool GRUPO-<N>-STATIC [14]
◦
R1(dhcp-config)# host 192.168.<X>.25 255.255.255.0 [14]
◦
R1(dhcp-config)# client-identifier <MAC address – obtido com ipconfig /all> [14]
◦
R1(dhcp-config)# client-name <nome> [17]
◦
R1(dhcp-config)# default-router 192.168.<X>.254 [17]
◦
R1(dhcp-config)# domain-name net-<N>.dei.uc.pt [17]
◦
R1(dhcp-config)# dns-server 192.168.<X>.31 10.254.0.252 [17]
◦
R1(dhcp-config)# exit [17]
◦
R1(config)# end [17]

Verificação/Limpeza no Router:
◦
R1# show ip dhcp binding [17]
◦
R1# clear ip dhcp binding * [17]

Configuração do PC:
◦
Obter uma nova configuração no PC usando ipconfig /release e ipconfig /renew [17].
